app/controllers/clients_controller.rb

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def update
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)