app/controllers/comments_controller.rb

  def create
    @comment = @task.comments.build(params[:comment])
    if @comment.save
---
INSERT INTO `comments` (`task_id`, `created_at`, `updated_at`, `user_id`, `message`) VALUES(3, '2009-01-29 18:36:28', '2009-01-29 18:36:28', 1, 'Provavelmente para instalar a gem RMagick precisará instalar algumas dependências:\r\n\r\nTalvez ajude:\r\n* sudo aptitude install imagemagick libmagick\r\n* apt-get install libmagick9-dev ')

  	def find_task
  		@task = Task.find(params[:task_id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3)