app/controllers/home_controller.rb

SELECT * FROM `tasks` WHERE (created_at > '2009-01-26 18:32:49') ORDER BY id desc LIMIT 5
SELECT * FROM `comments` WHERE (created_at > '2009-01-26 18:32:49') ORDER BY id desc LIMIT 5
SELECT * FROM `connections` ORDER BY id desc LIMIT 5
---
  def index
  	@tasks = Task.recent.all :limit => 5, :order => 'id desc'
  	@comments = Comment.recent.all :limit => 5, :order => 'id desc'
  	@connections = Connection.all :limit => 5, :order => 'id desc'

SELECT count(*) AS count_all, DATE_FORMAT(created_at, '%Y-%m') AS date_format_created_at_y_m FROM `users` WHERE (created_at BETWEEN '2008-01-29' AND '2009-01-29') GROUP BY DATE_FORMAT(created_at, '%Y-%m') ORDER BY created_at DESC
SELECT count(*) AS count_all, DATE_FORMAT(created_at, '%Y-%m') AS date_format_created_at_y_m FROM `projects` WHERE (created_at BETWEEN '2008-01-29' AND '2009-01-29') GROUP BY DATE_FORMAT(created_at, '%Y-%m') ORDER BY created_at DESC
SELECT count(*) AS count_all, DATE_FORMAT(created_at, '%Y-%m') AS date_format_created_at_y_m FROM `tasks` WHERE (created_at BETWEEN '2008-01-29' AND '2009-01-29') GROUP BY DATE_FORMAT(created_at, '%Y-%m') ORDER BY created_at DESC
---
  def stats

    g = Gruff::Line.new('600x200')
    g.theme = {
       #:colors => ['#ff6600', '#3bb000', '#1e90ff', '#efba00', '#0aaafd'],
       :colors => ['#FFA5FF', '#7FFF00', '#1e90ff', '#efba00', '#0aaafd'],
       :marker_color => '#aaa',
       :background_colors => ['#eaeaea', '#fff']
     }

    g.hide_title = true
    #g.font = File.expand_path('path/to/font.ttf', RAILS_ROOT)

    range = "created_at #{(6.months.ago.to_date..Date.today + 6.months).to_s(:db)}"
    #@stats_users = User.count(:all, :conditions => range, :group => "DATE_FORMAT(created_at, '%Y-%m')", :order =>"created_at ASC")
    @stats_users = User.count(:all, :conditions => range, :group => "strftime('%Y-%m', created_at)", :order =>"created_at ASC")
    @stats_projects = Project.count(:all, :conditions => range, :group => "strftime('%Y-%m', created_at)", :order =>"created_at ASC")
    @stats_tasks = Task.count(:all, :conditions => range, :group => "strftime('%Y-%m', created_at)", :order =>"created_at ASC")