app/controllers/projects_controller.rb

  def show
  	@tasks = @project.tasks.paginate(:page => params[:page], :order => 'id desc')
---
SELECT * FROM `tasks` WHERE (`tasks`.project_id = 1)
SELECT count(*) AS count_all FROM `tasks` WHERE (`tasks`.project_id = 1)

  	def find_project
	  	@project = Project.find(params[:id])
---
SELECT * FROM `projects` WHERE (`projects`.`id` = 1)