app/controllers/tasks_controller.rb

	def index
		@tasks = Task.paginate(:page => params[:page], :order => 'created_at DESC', :limit => 1)
---
SELECT * FROM `tasks` ORDER BY created_at DESC LIMIT 0, 30

  def show
  	@comments = @task.comments.paginate(:page => params[:page])
---
SELECT * FROM `comments` WHERE (`comments`.task_id = 1) ORDER BY id desc LIMIT 0, 10
SELECT count(*) AS count_all FROM `comments` WHERE (`comments`.task_id = 1)

  def create
    @task = @project.tasks.build(params[:task])
    respond_to do |format|
      if @task.save
---
INSERT INTO `tasks` (`name`, `created_at`, `project_id`, `updated_at`, `commented_at`, `user_id`, `message`, `state`) VALUES('Instalar Gems', '2009-01-29 18:34:03', 1, '2009-01-29 18:34:03', NULL, 1, 'Instalar Gems: brazilian-rails, rmagick, gruff', 'open')

  def update
    respond_to do |format|
      if @task.update_attributes(params[:task])
---
UPDATE `tasks` SET `updated_at` = '2009-01-29 19:17:44', `message` = 'Instalar Gems: brazilian-rails, rmagick, gruff, scruffy' WHERE `id` = 3

  	def find_task
  		@task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 3)