app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY created_at desc LIMIT 0, 30
SELECT count(*) AS count_all FROM `users`
---
  def index
		@users = User.paginate(:page => params[:page], :order => 'created_at desc')

UPDATE `users` SET `updated_at` = '2009-01-28 20:21:01', `session_at` = '2009-01-28 17:21:01' WHERE `id` = 1
INSERT INTO `connections` (`logon`, `user_id`, `address_ip`) VALUES('2009-01-28 17:21:01', 1, '127.0.0.1')
---
	def auth
    logout_keeping_session!
    user = User.authenticate(params[:login], params[:password])
    if user
      # Protects against session fixation attacks, causes request forgery
      # protection if user resubmits an earlier form using back
      # button. Uncomment if you understand the tradeoffs.
      # reset_session
      self.current_user = user
      new_cookie_flag = (params[:remember_me] == "1")
      handle_remember_cookie! new_cookie_flag
      redirect_back_or_default('/')
      flash[:notice] = t('flash.login')

      now = Time.now.to_s(:db)
      user.update_attribute(:session_at, now)
      last_connection = user.connections.build(:logon => now, :address_ip => request.remote_ip)
      last_connection.save rescue nil

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2009-01-28 20:21:12', `session_at` = NULL WHERE `id` = 1
---
	def logout
		user = User.find(current_user.id)
    user.update_attribute(:session_at, nil)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  	def find_user
		  @user = User.find(params[:id])